In [59]:
# import libraries
import pandas as pd
import numpy as np

In [60]:
# loading data
observations=pd.read_csv('observations.csv')
species=pd.read_csv('species_info.csv')

### Project Scoping ###

#### dataframe observations ###

In [61]:
observations.head()

            scientific_name                            park_name  observations
0        Vicia benghalensis  Great Smoky Mountains National Park            68
1            Neovison vison  Great Smoky Mountains National Park            77
2         Prunus subcordata               Yosemite National Park           138
3      Abutilon theophrasti                  Bryce National Park            84
4  Githopsis specularioides  Great Smoky Mountains National Park            85

In [62]:
observations.rename(columns={'observations': 'obs_num'}, inplace=True)
observations.head()

            scientific_name                            park_name  obs_num
0        Vicia benghalensis  Great Smoky Mountains National Park       68
1            Neovison vison  Great Smoky Mountains National Park       77
2         Prunus subcordata               Yosemite National Park      138
3      Abutilon theophrasti                  Bryce National Park       84
4  Githopsis specularioides  Great Smoky Mountains National Park       85

In [80]:
observations.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23296 entries, 0 to 23295
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   scientific_name  23296 non-null  object
 1   park_name        23296 non-null  object
 2   obs_num          23296 non-null  int64
dtypes: int64(1), object(2)
memory usage: 546.1+ KB

In [63]:
observations.shape

(23296, 3)

In [64]:
observations.dtypes

scientific_name    object
park_name          object
obs_num             int64
dtype: object

In [65]:
observations.nunique()

scientific_name    5541
park_name             4
obs_num             304
dtype: int64

In [66]:
observations.isna().sum()

scientific_name    0
park_name          0
obs_num            0
dtype: int64

In [79]:
observations['obs_num']=observations['obs_num'].where(observations['obs_num']!=0, np.nan)
observations.isna().sum()

scientific_name    0
park_name          0
obs_num            0
dtype: int64

#### dataframe species ###

In [69]:
species.head()

,category,scientific_name,common_names,conservation_status
0,Mammal,Clethrionomys gapperi gapperi,Gapper's Red-Backed Vole,NaN
1,Mammal,Bos bison,"American Bison, Bison",NaN
2,Mammal,Bos taurus,"Aurochs, Aurochs, Domestic Cattle (Feral), Dom...",NaN
3,Mammal,Ovis aries,"Domestic Sheep, Mouflon, Red Sheep, Sheep (Feral)",NaN
4,Mammal,Cervus elaphus,Wapiti Or Elk,NaN

In [81]:
species.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5824 entries, 0 to 5823
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   category             5824 non-null   object
 1   scientific_name      5824 non-null   object
 2   common_names         5824 non-null   object
 3   conservation_status  191 non-null    object
dtypes: object(4)
memory usage: 182.1+ KB

In [70]:
species.shape

(5824, 4)

In [71]:
species.dtypes

category               object
scientific_name        object
common_names           object
conservation_status    object
dtype: object

In [72]:
species.nunique()

category                  7
scientific_name        5541
common_names           5504
conservation_status       4
dtype: int64

In [73]:
species.isna().sum()

category                  0
scientific_name           0
common_names              0
conservation_status    5633
dtype: int64

In [74]:
species.conservation_status.unique()

array([nan, 'Species of Concern', 'Endangered', 'Threatened',
       'In Recovery'], dtype=object)

In [75]:
# characterizing missingness in col 'conservation_status'
pd.crosstab(species['category'], species['conservation_status'].isna(),rownames=['category'], colnames=['conservation is na'])

conservation is na  False  True
category
Amphibian               7    73
Bird                   79   442
Fish                   11   116
Mammal                 38   176
Nonvascular Plant       5   328
Reptile                 5    74
Vascular Plant         46  4424